Repository: GeotrekCE/Geotrek
Catalog: docs/locale/*/LC_MESSAGES/install/installation.po
Languages: fr

source: Ubuntu package
fr: Paquet Ubuntu

source: Use these instructions to install Geotrek-admin in an easy way on a dedicated Ubuntu Focal Fossa 20.04 LTS server for production. For another distributions, please use :ref:`the Docker installation method <docker-section>`. It requires more technical skills. Lastly, for a developer instance, please follow :ref:`the dedicated procedure <development-section>`.
fr: Utilisez ces instructions pour installer Geotrek-admin de manière simple sur un serveur Ubuntu Focal Fossa 20.04 LTS dédié à la production. Pour d'autres distributions, veuillez utiliser :ref:`la méthode d'installation Docker <docker-section>`. Elle nécessite plus de compétences techniques. Enfin, pour une instance de développeur, veuillez suivre :ref:`la procédure dédiée <development-section>`.

source: Requirements
fr: Prérequis

source: Geotrek is mostly a CPU-bound application due to the complex queries including geometric operations (such as intersections) which are executed on the database. This is especially true in the setup with a Geotrek Rando v3 portal requesting dynamic geometric data through the Geotrek API.
fr: Geotrek est principalement une application liée au CPU en raison des requêtes complexes comprenant des opérations géométriques (telles que les intersections) qui sont exécutées sur la base de données. Ceci est particulièrement vrai dans le cas d'un portail Geotrek Rando v3 qui demande des données géométriques dynamiques via l'API de Geotrek.

source: In such a configuration the required system resources should be:
fr: Dans une telle configuration, les ressources nécessaires au système devraient être les suivantes :

source: 4 cores
fr: 4 cœurs

source: 8 Go RAM or more
fr: 8 Go de RAM ou plus

source: 50 Go disk space or more (20 Go + estimated size of attached files like photos, including elements imported from SIT)
fr: 50 Go d'espace disque ou plus (20 Go + taille estimée des fichiers joints tels que les photos, y compris les éléments importés des SIT)

source: If spreading the components on multiple hosts keep in mind the bottleneck will most likely be the CPU and RAM at the database server level.
fr: Si vous répartissez les composants sur plusieurs hôtes, n'oubliez pas que le goulot d'étranglement sera très probablement l'unité centrale et la mémoire vive au niveau du serveur de base de données.

source: Software requirements are:
fr: Les prérequis logiciels sont :

source: Ubuntu Focal Fossa 20.04 LTS. Server flavor is recommended but any other flavors work too (desktop…)
fr: Ubuntu Focal Fossa 20.04 LTS. La version 'serveur' est recommandée, mais d'autres peuvent fonctionner (desktop…)

source: An Internet connection with open HTTP and HTTPS destination ports is required.
fr: Une connexion internet avec les port HTTP et HTTPS est requise.

source: Information to prepare before installation
fr: Informations à préparer avant l'installation

source: These information will be asked during the installation process and are the basic configuration of Geotrek-admin:
fr: Ces informations vous seront demandées lors de l'installation et constituent la configuration de base de Geotrek-admin :

source: The **domain name** or **IP** to use to access to **Geotrek-admin** web application.
fr: Le **nom de domaine** ou **IP** à utiliser pour accéder à l'application web **Geotrek-admin**.

source: Rando server name: the **domain name** to use to access to **Geotrek-rando** website (optional, if appropriate).
fr: Nom du serveur Rando : le **nom de domaine** à utiliser pour accéder au site web **Geotrek-rando** (facultatif, le cas échéant).

source: PostgreSQL **host, port, user, password and DB name** if you use an external DB server.
fr: PostgreSQL **hôte, port, utilisateur, mot de passe et nom de la base de données** si vous utilisez un serveur de base de données externe.

source: The **SRID** of the projection to use to store geometries. The projection must match your geographic area and coordinates must be in meters.
fr: Le **SRID** de la projection à utiliser pour stocker les géométries. La projection doit correspondre à votre zone géographique et les coordonnées doivent être exprimées en mètres.

source: The list of **languages** into which translation of contents will be made
fr: La liste des **langues** dans lesquelles la traduction du contenu sera effectuée

source: The name or acronym of your **organization**
fr: Le nom ou l'acronyme de votre **organisation**

source: Fresh installation
fr: Nouvelle installation

source: Run the following command in a shell prompt on your server:
fr: Exécutez la commande suivante dans une invite shell sur votre serveur :

source: If you don't want to use a local database, you can run the following command instead. This will prevent the script to install PostgreSQL server locally. Don't forget to enable PostGIS extension in your remote database before installation.
fr: Si vous ne souhaitez pas utiliser une base de données locale, vous pouvez exécuter la commande suivante à la place. Cela empêchera le script d'installer le serveur PostgreSQL localement. N'oubliez pas d'activer l'extension PostGIS dans votre base de données distante avant l'installation.

source: Then create the application administrator account and connect to the web interface.
fr: Créez ensuite le compte de l'administrateur de l'application et connectez-vous à l'interface web.

source: If you are not confident with the ``install.sh`` script, or if you are having troubles, you can do the same operations by hand:
fr: Si vous n'avez pas confiance dans le script ``install.sh``, ou si vous avez des problèmes, vous pouvez faire les mêmes opérations à la main :

source: Add ``deb https://packages.geotrek.fr/ubuntu bionic main`` to APT sources list.
fr: Ajoutez ``deb https://packages.geotrek.fr/ubuntu focal main`` aux sources APT.

source: Add https://packages.geotrek.fr/geotrek.gpg.key to apt keyring.
fr: Ajouter https://packages.geotrek.fr/geotrek.gpg.key au gestionnaire de clés APT.

source: Run ``apt-get update``
fr: Lancer ``apt-get update``

source: If you want to use a local database, install PostGIS package (before installing Geotrek-admin, not at the same time). If not, you must create database and enable PostGIS extension before.
fr: Si vous souhaitez utiliser une base de données locale, installez le paquet PostGIS (avant d'installer Geotrek-admin, pas en même temps). Sinon, vous devez créer une base de données et activer l'extension PostGIS au préalable.

source: Install the Geotrek-admin package (``sudo apt install geotrek-admin``).
fr: Installez le paquet Geotrek-admin (``sudo apt install geotrek-admin``).

source: Geotrek-admin is automatically installed in ``/opt/geotrek-admin/`` directory.
fr: Geotrek-admin est automatiquement installé dans le répertoire ``opt/geotrek-admin/``.

source: The installation automatically creates an internal ``geotrek`` linux user, owner of this directory
fr: L'installation crée automatiquement un utilisateur linux interne ``geotrek``, propriétaire de ce répertoire

source: The Geotrek-admin Python application is located in ``/opt/geotrek-admin/lib/python3.x/site-packages/geotrek`` directory
fr: L'application Python Geotrek-admin se trouve dans le répertoire ``opt/geotrek-admin/lib/python3.x/site-packages/geotrek``

source: Extra steps
fr: Étapes supplémentaires

source: We highly recommend installing an antivirus software to regularly scan uploaded files located under ``/opt/geotrek-admin/var/media/``.
fr: Nous vous recommandons vivement d'installer un logiciel antivirus pour analyser régulièrement les fichiers téléchargés situés sous ``/opt/geotrek-admin/var/media/``.

source: Here is the installation process for `ClamAV <https://www.clamav.net/>`_ :
fr: Voici le processus d'installation de `ClamAV <https://www.clamav.net/>`_ :

source: Prepare quarantine folder for suspicious files:
fr: Créer un dossier de quarantaine pour les fichiers suspects :

source: Configure ClamAV via cron, to scan the folder once a day, put suspicious files in quarantine, and raise email alerts, by creating file ``/etc/cron.daily/clamscan`` with the following content:
fr: Configurer ClamAV via cron, pour scanner le dossier une fois par jour, mettre les fichiers suspects en quarantaine, et envoyer des alertes par email, en créant le fichier ``/etc/cron.daily/clamscan`` avec le contenu suivant :

source: Make sure to change alert recepient (``admin@example.com`` above) and make this cron file executable:
fr: Assurez-vous de changer le destinataire de l'alerte (``admin@example.com``) et de rendre ce fichier cron exécutable :

source: If a suspicious file is put in quarantine, you will need to manually delete the corresponding attachment from Geotrek-Admin (since the file for this attachment has moved to the quarantine folder, it will no longer be found).
fr: Si un fichier suspect est placé en quarantaine, vous devez supprimer manuellement la pièce jointe correspondante à partir de Geotrek-Admin (puisque le fichier de cette pièce jointe a été déplacé dans le dossier de quarantaine, il ne sera plus trouvé).

source: Uninstallation
fr: Désinstallation

source: Run:
fr: Lancez :

source: Media files will be left in ``/opt/geotrek-admin/var`` directory. To remove them, run:
fr: Les fichiers médias seront laissés dans le répertoire ``opt/geotrek-admin/var``. Pour les supprimer, exécutez :

source: To remove dependencies (convertit, screamshoter…), run:
fr: Pour supprimer des dépendences (convertit, screamshoter…), lancer :

source: PostgreSQL and its database will not be removed by these commands. If need be, remove them manually.
fr: PostgreSQL et ses bases de données ne seront pas supprimés par ces commandes. Si besoin, supprimez-les manuellement.

source: Docker is an alternative installation method, recommended for experts only. It allows to install several instances of Geotrek-admin on the same serveur, and to install it on other distributions than Ubuntu.
fr: Docker est une méthode d'installation alternative, recommandée uniquement aux experts. Elle permet d'installer plusieurs instances de Geotrek-admin sur le même serveur, et de l'installer sur d'autres distributions qu'Ubuntu.

source: Install Docker and Docker Compose, either from your distribution or from upstream packages (cf. https://docs.docker.com/install/)
fr: Installer Docker et Docker Compose, soit à partir de votre distribution, soit à partir de paquets amont (cf. https://docs.docker.com/install/).

source: Download the code from https://github.com/GeotrekCE/Geotrek-admin/releases or checkout it with git from https://github.com/GeotrekCE/Geotrek-admin/
fr: Télécharger le code à partir de https://github.com/GeotrekCE/Geotrek-admin/releases ou le récupérer avec git à partir de https://github.com/GeotrekCE/Geotrek-admin/

source: Unzip the tarball
fr: Décompresser l'archive

source: Copy docker/install folder where you want
fr: Copier le dossier docker/install à l'endroit désiré

source: Create user and database, enable PostGIS extension
fr: Créer un utilisateur et une base de données, activer l'extension PostGIS

source: Install NGINX (or equivalent) and add a configuration file (taking inspiration from `nginx.conf.in`)
fr: Installez NGINX (ou équivalent) et ajouter un fichier de configuration (en s'inspirant de `nginx.conf.in`)

source: Management commands
fr: Commandes de gestion

source: To load minimal data and create an application superuser, run:
fr: Pour charger les données minimales et créer un superutilisateur d'application, exécutez :
